DataProcessors/Renault_ПолучениеДанныхИзBVM.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>Renault_ПолучениеДанныхИзBVM</Name>
			<Comment>Версия для DMS Cервиса</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматРезультата</Name>
					<Comment>Возможные типы "Таблица" возвращает ТаблицаЗначений, "Отчет" - формирует отчет - возврат null</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросПоVIN</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакрыватьПоОкончании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>BIR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/Renault_ТикетыAp2Ap.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ТикетыAp2Ap</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТикетВыполнен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОшибкаВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибкиВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Тикет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ДополнительнаяИнформацияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ДополнительнаяИнформацияАвтомобилей</Name>
			<Comment>Дополнительная информация автомобилей</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Хозяин</Name>
					<Comment>Признак хозяина автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пробег</Name>
					<Comment>Признак пробега автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосНомер</Name>
					<Comment>Признак государственного номера автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТехПаспорт</Name>
					<Comment>Признак номера техпаспорта автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидАвтомобиля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКонсигнации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервиснаяКнижка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПараллельныйИмпорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаОкончанияОтсрочкиОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГаражныйНомер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапретНаВнутренниеПерепродажи</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Renault_ПараметрыПодключенияКСервисам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ПараметрыПодключенияКСервисам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Опции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Опции</Name>
			<Comment>Опции автомобилей</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Номер по каталогу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакНабора</Name>
					<Comment>Признак набора</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакКомплекта</Name>
					<Comment>Признак комплекта</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Comment>Используется для ведения дополнительного учета валютной себестомости и цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпцияАвтоРу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОпцииАвтоРу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпцияАвито</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОпцииАвито</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставНабора</Name>
					<Comment>Состав набора</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Опция</Name>
							<Comment>Опция набора</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Опции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/Renault_ПолучениеДанныхИзBVM/Ext/ObjectModule.bsl
Перем АвтодокВерсия Экспорт;
Перем ТаблицаПоказателей Экспорт;
Перем ТаблицаОпций Экспорт;
Перем НоваяСтрока;

#Если наКлиенте тогда
Перем Тикет Экспорт;


////@+ Процедура Функция()
// Дата создания - 31.05.2012 15:20:14; 
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Выполняет отправку запроса к BVM через систему A2A
//
// Параметры
//  Без параметров
//@-
Функция ОтправитьЗапрос_A2A(BIR = Неопределено) Экспорт

	Если ЗапросПоVIN тогда
		
		Если НЕ ТипЗнч(Автомобиль) = Тип("Строка") тогда
			VIN = Автомобиль.VIN;
		Иначе
			VIN = СокрЛП(Автомобиль);
		КонецЕсли;
		
	Иначе
		
		Если НЕ ТипЗнч(Автомобиль) = Тип("Строка") тогда
			АвтомобильОбъект = Автомобиль.ПолучитьОбъект();
			VIN = АвтомобильОбъект.ЧтениеЗначенияРегистраСведения(Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		Иначе
			
			VIN = СокрЛП(Автомобиль);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(VIN) тогда 
		
		Сообщить(?(ЗапросПоVIN, "VIN автомобиля", "Гос. номер автомобиля") +" не заполнен. Запрос отменен.");
		Возврат ложь;
		
	КонецЕсли;
	
	КодСтраны = "RU";
	
	Если НЕ ЗначениеЗаполнено(BIR) Тогда
	
		BIR = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	
	КонецЕсли;

	//*//Renault_ОбщийМодуль.ПолучитьИдентификатор(ПараметрыСеанса.Организация);
	
	Тикет = РегистрыСведений.Renault_ТикетыAp2Ap.СоздатьНовыйТикет();
	
	Renault_Ap2Ap.ИнформацияПоАвтоИзBVM(Тикет, КодСтраны, СокрЛП(BIR), VIN,?(ЗапросПоVIN, "vin", "immatriculation"));
	
	Возврат Истина;
	
КонецФункции // ОтправитьЗапрос_A2A()

Функция ПолучитьВебСервис() 
	
	ДанныеПодключения = Справочники.Renault_ПараметрыПодключенияКСервисам.ПолучитьПараметрыПодключенияПоСсылке(
		Справочники.Renault_ПараметрыПодключенияКСервисам.WSGate,
		"TDFa.1cws");
	Адрес = ДанныеПодключения.Адрес;
	ЛогинWS = ДанныеПодключения.Логин;
	ПарольWS = ДанныеПодключения.Пароль;
	WSОпределение = Renault_ОбщегоНазначенияПовтИсп.ОпределениеTDFa(Адрес, ЛогинWS, ПарольWS);
	ВебСервис = Новый WSПрокси(
		WSОпределение, 
		"http://v8.1c.ru/8.1/data/core", 
		"Renault_TDFa", 
		"Renault_TDFaSoap12",
		3600);
	ВебСервис.Пользователь = СокрЛП(ЛогинWS);
	ВебСервис.Пароль = СокрЛП(ПарольWS);
	Возврат ВебСервис;
	
КонецФункции

////@+ Функция ПолучитьРезультатТикета()
// Дата создания - 19.04.2012 11:49:33; 
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Производит считывание результат выполнения тикета из регистра сведений
//
// Параметры
//  Без параметров
//@-
Функция ПолучитьРезультатТикета() Экспорт
	
	РезультатПолучен = Ложь;
	
	Прокси = ПолучитьВебСервис();
	BIR = Renault_ОбщийМодуль.ПолучитьBIRБазыДанных();
	Ответ = Прокси.GetStatus(BIR, Тикет);
	Если Ответ <> "" Тогда
		РегистрыСведений.Renault_ТикетыAp2Ap.ЗаписатьРезультат(Ответ, Тикет);
	КонецЕсли;
	
	МЗ = РегистрыСведений.Renault_ТикетыAp2Ap.СоздатьМенеджерЗаписи();
	МЗ.Тикет = Тикет;
	
	МЗ.Прочитать();
	
	//Если все удачно
	Если МЗ.ТикетВыполнен и НЕ МЗ.ОшибкаВыполнения тогда //ТикетВыполнен = Истина и НЕ ОшибкаВыполнения = Ложь => Истина
		
		Результат = МЗ.Результат.Получить();
		
		// Комментарий 
		//Дата создания - 31.05.2012 16:53:31; Автор - Окипний Андрей Евгеньевич
		//отправляем результат на разбор
		//
		
		

		РезультатПолучен = РазобратьРезультат(Результат);
		
	КонецЕсли;
	
	//Если ошибка
	Если МЗ.ОшибкаВыполнения тогда
		
		Сообщить("Ошибка выполнения тикета - " + Тикет);
		Сообщить("------------------------------------");
		Сообщить(МЗ.ОписаниеОшибкиВыполнения);
		
		РезультатПолучен = Истина;
		
	КонецЕсли;
	
	МЗ = Неопределено;
	
	Возврат РезультатПолучен;
	
КонецФункции // ПолучитьРезультатТикета()

////@+ Процедура РазобратьРезультат(ТекстОтвета)
// Дата создания - 31.05.2012 16:54:48;
// Автор - Окипний Андрей Евгеньевич
// 
// Описание процедуры
//  Процедура вырезает лишние строки <A2A></A2A> из документа XML. 
//  затем выбирает нужные блоки и добавляет их в таблицу значений.
//
// Параметры
//  Парам1 ТекстОтвета  - Текст строкой - текст XML с ответом
//
//@-
Функция РазобратьРезультат(ТекстОтвета)

	//Проверим наличие ошибок
	// Комментарий 
	//Дата создания - 05.07.2012 11:37:59; Автор - Окипний Андрей Евгеньевич
	//Для этого найдем подстроку "returnCode=". Дальше посмотрим какие цифры дальше
	//
	ПозицияКодаОшибки = Найти(ТекстОтвета,"returnCode=") + стрДлина("returnCode=");
	
	КодОшибки = "Er" + Сред(ТекстОтвета, ПозицияКодаОшибки + 1, 4);
	
	Попытка //Такого элемента может не быть. Поэтому в попытке
	
		Ошибка = Справочники.Renault_Ap2Ap_СписокОшибок[КодОшибки];
		
		Сообщить("Ошибка при получении данных!" + символы.ПС +
				 "Код - " + Ошибка.Код + ". Описание - " + Ошибка.Наименование);
		Возврат Истина;
	Исключение КонецПопытки; 
	
	ПоследовательностьЭлементов = "";
	
	// Комментарий 
	//Дата создания - 31.05.2012 17:01:48; Автор - Окипний Андрей Евгеньевич
	//Выводить в отчет будем построителем отчета. Поэтому таблица показателей должна быть
	//типизированной. Получим чистую таблицу запросом.
	//
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(16)) КАК Показатель,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК Значение,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(20)) КАК НаименованиеПоказателя");
	
	ТаблицаПоказателей = Запрос.Выполнить().Выгрузить();
	ТаблицаПоказателей.Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(16)) КАК Значение,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК Наименование");
	
	//ТаблицаОпций = Новый ТаблицаЗначений();
		
				
	ТаблицаОпций = Запрос.Выполнить().Выгрузить();
	ТаблицаПоказателей.Очистить();
	
	ТаблицаОпций.Колонки.Добавить("codeObjet");
	ТаблицаОпций.Колонки.Добавить("codeCritere");
	ТаблицаОпций.Колонки.Добавить("libelle");
	
	//Уберем обертку A2A
	ТекстXML = СтрЗаменить(Сред(ТекстОтвета, Найти(ТекстОтвета,"<?")),"</A2A>","");
	
	Ответ_A2A = Новый ЧтениеXML;

	Попытка
	
		Ответ_A2A.УстановитьСтроку(ТекстXML);
	
	Исключение
		//Определимся потом
	КонецПопытки;
	
	Пока Истина Цикл
		
		ОчереднойУзелXMLПрочитан = Ложь;
		
		Попытка
			ОчереднойУзелXMLПрочитан = Ответ_A2A.Прочитать();
		Исключение
			
			Успешно = Ложь;
			Прервать;
			
		КонецПопытки;
		
		Если НЕ ОчереднойУзелXMLПрочитан Тогда
			Прервать;
		КонецЕсли;	
		
		ТипУзла = Ответ_A2A.ТипУзла;
		ИмяУзла = Ответ_A2A.Имя;
		
		Если ИмяУзла = "Critere" И ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			НоваяСтрока = ТаблицаОпций.Добавить();
			НоваяСтрока.codeObjet = Ответ_A2A.ПолучитьАтрибут("codeObjet");
			НоваяСтрока.libelle = Ответ_A2A.ПолучитьАтрибут("libelle"); 
						
		КонецЕсли;

				
		Если ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			ПоследовательностьЭлементов = ДобавитьЭлементКПоследовательности(ПоследовательностьЭлементов, ИмяУзла);
			
			Успешно = ОбработатьНачалоЭлемента(Ответ_A2A, ПоследовательностьЭлементов, ТаблицаПоказателей);
			
			Если НЕ Успешно Тогда
				Прервать;
			КонецЕсли;	
			
		ИначеЕсли ТипУзла = ТипУзлаXML.КонецЭлемента Тогда

			ПоследовательностьЭлементов = УдалитьПоследнийЭлементИзПоследовательности(ПоследовательностьЭлементов);
			
		ИначеЕсли ТипУзла = ТипУзлаXML.Текст Тогда	
			
			ЗначениеЭлемента = Ответ_A2A.Значение;
			Элемент = Ответ_A2A;
			Успешно = ОбработатьЗначениеЭлемента(ПоследовательностьЭлементов, ЗначениеЭлемента, ТаблицаПоказателей, Элемент);
			
			Если НЕ Успешно Тогда
				Прервать;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЦикла;

	// Комментарий 
	//Дата создания - 05.07.2012 11:48:14; Автор - Окипний Андрей Евгеньевич
	//проверим Наличие данных в колонке Значение.
	//Для этого выгрузим её в отдельную таблицу значений, свернем её и удалим пустые строки
	//После чего посчитаем количество строк.
	//
	ВрТз = ТаблицаПоказателей.Скопировать(,"Значение");
	ВрТз.Свернуть("Значение");
	
	ПустаяСтрока = ВрТЗ.Найти(Неопределено, "Значение");
	
	Пока ПустаяСтрока <> Неопределено Цикл
		
		ВрТЗ.Удалить(ПустаяСтрока);
		ПустаяСтрока = ВрТЗ.Найти(Неопределено, "Значение");
		
	КонецЦикла;
	
	Если ВрТЗ.Количество() = 0 Тогда //Данные не были получены
		Сообщить("Данные не получены." + Символы.ПС +
				 "Проверте корректность VIN или гос. номера автомобиля." + Символы.ПС + 
				 "Если все правильно, значит данные отсутствуют в системе BVM.");
		Возврат Истина;
		
	КонецЕсли;
		
	Если Успешно и ВРег(ФорматРезультата) = "ОТЧЕТ" тогда
		
	// Комментарий 
	//Дата создания - 18.06.2012 15:31:05; Автор - Окипний Андрей Евгеньевич
	//Формируем таблицу с показателями через построитель запросов с выводом в 
	//Общую форму Печатная форма документов
	
		ПечФорма = ПолучитьОбщуюФорму("ПечатнаяФормаДокументов");
		
		ПостроительОтчета = Новый ПостроительОтчета;
		ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаПоказателей);
		ПостроительОтчета.ЗаполнитьНастройки();
		ПостроительОтчета.Выполнить();
		
		//Для начала Очистим выбранные поля
		ПостроительОтчета.ВыбранныеПоля.Очистить();
		//Теперь добавим нужные нам
		ПостроительОтчета.ВыбранныеПоля.Вставить("НаименованиеПоказателя", "НаименованиеПоказателя", 1);
		ПостроительОтчета.ВыбранныеПоля[0].Представление = "Параметр";
		ПостроительОтчета.ВыбранныеПоля.Вставить("Значение","Значение",2);
		
		ПостроительОтчета.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Медь);
		ПостроительОтчета.Вывести(ПечФорма.ЭлементыФормы.ТабличныйДокумент);
		
		
		ТаблицаОпций.Колонки.Удалить("codeObjet");
		ТаблицаОпций.Колонки.Удалить("libelle");
		ТаблицаОпций.Колонки.Удалить("codeCritere");
		
		ТаблицаОпций.Сортировать("Наименование Возр");

		
		ПостроительОтчета = Новый ПостроительОтчета;
		ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТаблицаОпций);
		ПостроительОтчета.ЗаполнитьНастройки();
		ПостроительОтчета.Выполнить();
		
		ПостроительОтчета.ВыбранныеПоля[0].Представление = "Код опции";
		ПостроительОтчета.ВыбранныеПоля[1].Представление = "Наименование опции";
		
		ПостроительОтчета.МакетОформления = ПолучитьМакетОформления(СтандартноеОформление.Медь);
		ПостроительОтчета.Вывести(ПечФорма.ЭлементыФормы.ТабличныйДокумент);
		
		
		ПечФорма.Заголовок = "Детальные данные по автомобилю: " + Строка(Автомобиль);
		
		ПечФорма.Открыть();
		
		Возврат Истина;
	ИначеЕсли Успешно и ВРег(ФорматРезультата) = "ТАБЛИЦА" тогда
		
		// Комментарий 
		//Дата создания - 19.06.2012 10:26:12; Автор - Окипний Андрей Евгеньевич
		//Таблица уже готова, просто возвращаем Истина
		//
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции // РазобратьРезультат(Текстответа)

Функция ДобавитьЭлементКПоследовательности(Знач ПоследовательностьЭлементов, Знач ИмяУзла)
	
	Если НЕ ПоследовательностьЭлементов = "" Тогда
		ПоследовательностьЭлементов = ПоследовательностьЭлементов + ".";	
	КонецЕсли;
	
	ПоследовательностьЭлементов = ПоследовательностьЭлементов + ИмяУзла;
	
	Возврат ПоследовательностьЭлементов;
	
КонецФункции

Функция УдалитьПоследнийЭлементИзПоследовательности(Знач ПоследовательностьЭлементов);
	
	ПромСтрока 			= СтрЗаменить(ПоследовательностьЭлементов, ".", Символы.ПС);
	КоличествоЭлементов = СтрЧислоСтрок(ПромСтрока);
	
	ПоследовательностьЭлементов	= "";
	Если КоличествоЭлементов > 0 Тогда
		КоличествоЭлементов = КоличествоЭлементов - 1;
		Для Счетчик = 1 По КоличествоЭлементов Цикл
			ПоследовательностьЭлементов	= ПоследовательностьЭлементов + "." + СтрПолучитьСтроку(ПромСтрока, Счетчик);
		КонецЦикла;	
		ПоследовательностьЭлементов = Прав(ПоследовательностьЭлементов, СтрДлина(ПоследовательностьЭлементов) - 1);
	КонецЕсли;
	
	Возврат ПоследовательностьЭлементов;
КонецФункции	

Функция ОбработатьНачалоЭлемента(Ответ_A2A, Знач ИмяЭлемента, ТаблицаПоказателей);
	
	Успешно = Истина;
	
	ТекущаяСтрокаТаблицы  	  = Неопределено;
	
	Если ИмяЭлемента = "Response.MQ_Response.Donnees.VIN" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "Vin";
		НовыйПоказатель.НаименованиеПоказателя = "VIN";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.NumeroDeFabrication" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "ProductionNumber";
		НовыйПоказатель.НаименованиеПоказателя = "Заводской номер";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.TAPV" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "AftersalesType";
		НовыйПоказатель.НаименованиеПоказателя = "TAPV";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.DateDeFabrication" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "ProductionDate";
		НовыйПоказатель.НаименованиеПоказателя = "Дата выпуска";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.AnneeDeFabrication" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "ProductionYear";
		НовыйПоказатель.НаименованиеПоказателя = "Год выпуска";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.NumeroImmatriculation" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "PlateNumber";
		НовыйПоказатель.НаименованиеПоказателя = "Номерной знак";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.Modele" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "Model";
		НовыйПоказатель.НаименованиеПоказателя = "Код модели";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.CodeModele2" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "BodyModel";
		НовыйПоказатель.НаименованиеПоказателя = "Код кузова";
				
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.Version" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "Version";
		НовыйПоказатель.НаименованиеПоказателя = "Код версии";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.LibelleModele" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "ModelText";
		НовыйПоказатель.НаименованиеПоказателя = "Наименование модели";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.LibelleCarrosserie" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "BodyworkText";
		НовыйПоказатель.НаименованиеПоказателя = "Наименование кузова";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.NumeroDeMoteur" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "MotorNumber";
		НовыйПоказатель.НаименованиеПоказателя = "Номер двигателя";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.TypeMoteur" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "MotorType";
		НовыйПоказатель.НаименованиеПоказателя = "Тип двигателя";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.IndiceMoteur" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "MotorIndex";
		НовыйПоказатель.НаименованиеПоказателя = "Индекс двигателя";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.TypeBoite" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "GearboxType";
		НовыйПоказатель.НаименованиеПоказателя = "Тип КПП";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.IndiceBoite" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "GearboxIndex";
		НовыйПоказатель.НаименованиеПоказателя = "Индекс КПП";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.NumeroDeBoite" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "GearboxNumber";
		НовыйПоказатель.НаименованиеПоказателя = "Номер КПП";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.DateImmatriculation" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "RegistrationDate";
		НовыйПоказатель.НаименованиеПоказателя = "Дата регистрации";
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.MarqueCommerciale" Тогда
		
		НовыйПоказатель = ТаблицаПоказателей.Добавить();
		НовыйПоказатель.Показатель = "Mark";
		НовыйПоказатель.НаименованиеПоказателя = "Марка";
		
	КонецЕсли;
	
	
	Возврат Успешно;
	
КонецФункции

////@+ Функция ОбработатьЗначениеЭлемента(Знач ИмяЭлемента, Знач ЗначениеЭлемента, ТаблицаПоказателей)
// Дата создания - 18.06.2012 14:41:33;
// Автор - Окипний Андрей Евгеньевич
//
// Описание функции
// <Вставить описание>
//
// Параметры
//  Парам1 ИмяЭлемента  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  Парам2 ЗначениеЭлемента  - Строка(200) - Строковое значение параметра
//
//  Парам3 ТаблицаПоказателей  - ТаблицаЗначений - Таблица значений, в которой храним полученные данные
//
// Возвращаемое значение
//  Успешно  - Булево - Истина (по умолчанию) разбор успешен
//  Ложь - разбор не успешен
//@-
Функция ОбработатьЗначениеЭлемента(Знач ИмяЭлемента, Знач ЗначениеЭлемента, ТаблицаПоказателей, Ответ_A2A = Неопределено) 
	
	//Первоначальная инициализация
	Успешно = Истина;
	
	ТекПоказатель = Неопределено;
	
	Если ИмяЭлемента = "Response.MQ_Response.Donnees.VIN" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("Vin", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.NumeroDeFabrication" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("ProductionNumber", "Показатель");
	
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.TAPV" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("AftersalesType", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.DateDeFabrication" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("ProductionDate", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.AnneeDeFabrication" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("ProductionYear", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.NumeroImmatriculation" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("PlateNumber", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.Modele" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("Model", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.CodeModele2" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("BodyModel", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.Version" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("Version", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.LibelleModele" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("ModelText", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.LibelleCarrosserie" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("BodyworkText", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.NumeroDeMoteur" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("MotorNumber", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.TypeMoteur" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("MotorType", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.IndiceMoteur" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("MotorIndex", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.TypeBoite" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("GearboxType", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.IndiceBoite" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("GearboxIndex", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.NumeroDeBoite" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("GearboxNumber", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.DateImmatriculation" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("RegistrationDate", "Показатель");
		
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.MarqueCommerciale" Тогда
		
		ТекПоказатель = ТаблицаПоказателей.Найти("Mark", "Показатель");		
			
	ИначеЕсли ИмяЭлемента = "Response.MQ_Response.Donnees.TousLesCriteres.Critere" Тогда
		
		НоваяСтрока.Значение = Ответ_A2A.Значение;
		Наименование = Справочники.Опции.НайтиПоРеквизиту("Артикул",СокрЛП(Ответ_A2A.Значение));
		
		Если ЗначениеЗаполнено(Наименование) Тогда
			
			Если ЗначениеЗаполнено(Наименование.НаименованиеПолное) И Наименование.НаименованиеПолное <> "-" Тогда
			
				НоваяСтрока.Наименование = Наименование.НаименованиеПолное;
				
			Иначе
				
				НоваяСтрока.Наименование = НоваяСтрока.libelle;
				
			КонецЕсли;
			
		Иначе
			
			НоваяСтрока.Наименование = НоваяСтрока.libelle;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ТекПоказатель = Неопределено тогда
		ТекПоказатель.Значение = СокрЛП(ЗначениеЭлемента);
	КонецЕсли;
	
	//Пока всегда успешно
	Возврат Успешно;
	
КонецФункции // ОбработатьЗначениеЭлемента(Знач ИмяЭлемента, Знач ЗначениеЭлемента, ТаблицаПоказателей)

#КонецЕсли

ФорматРезультата = "ОТЧЕТ";
ТаблицаПоказателей = Неопределено;

АвтодокВерсия = "1_00_02";
